// Вам необхідно виконати завдання з популярного циклу челенджів: JS30. https://javascript30.com/
// (Радимо після курсу – пройти його повністю, він безкоштовний)

// Необхідно написати програму, яка буде зчитувати з клавіатури натискання клавіш та відтворювати унікальний звук для кожної клавіши (клавіши можуть бути будь-які, звуки можуть бути будь-які, тільки вкажіть у верстці – які кнопки натискати).https://www.freesfx.co.uk/Category/Bass/272

// Функція пошуку елемента.
export const getElement = (selector) =>{
    return document.querySelector(selector)
}
