// Чекаємо поки завантажується вся сторінка, потім запускаємо код.
window.onload = function() {

    // Необхідно написати програму, яка виконує складання чисел від N доM (N та M – задаються користувачем), а також програма має вміти пропускати парні числа.

    // Отримуємо числа.
    let N = Number(prompt('Введіть ціле число.N за замовчуванням 0')).toFixed();
    let M = Number(prompt('Введіть ціле число.M за замовчуванням 10')).toFixed();

    // Перевірка на 'NaN' та значення за замовчуванням.
    N = N === 'NaN' ? 0 : N ;
    M = M === 'NaN' || +M === 0 ? 10 : M;

    // Отримуємо булевий параметр(true/false).
    const flag = confirm('Пропускати парні числа?');
    // Створюємо змінні результат та помика.
    let result = 0;
    let error = false;

    // Робимо додавання через цикл з отриманими параметрами.
    if(+N < +M){
        for(let i = +N; i <= +M; i++){

            if(flag){

                if(i%2 === 1){
                    result += i
                } 
            }
            else result += i
        
        }
    }
    else error = 'N Не може бути більша або дорівнювати М';

    //Виводимо результати в консоль.
    console.log('N :', N)
    console.log('M :', M)
    console.log("Булевий параметр: ",flag);
    console.log('Результат :',error ? error: result);

    // Виводимо результати на сторінку.
    document.getElementById('decision_1').innerHTML = `
    N = ${N} <br/>
    M = ${M} <br/>
    ${error ? 
        `<span>${error}</span>`: 
        `Додаємо числа від ${N} до ${M} <br/>
        Парні числа ${flag ? 'ігноруємо':'додаємо'}.<br/>
        Зузультат : ${result}`}`;

}